# ConnectionValidationWarning Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionValidationWarning Constructor
ConnectionValidationWarning Class See Also
---
Constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ConnectionValidationWarning(
	ConnectionResolution resolution,
	ConnectionWarning reason,
	ElementId part1,
	ElementId part2
)
```

Visual Basic
---
```text
Public Sub New ( _
	resolution As ConnectionResolution, _
	reason As ConnectionWarning, _
	part1 As ElementId, _
	part2 As ElementId _
)
```

Visual C++
---
```text
public:
ConnectionValidationWarning(
	ConnectionResolution resolution,
	ConnectionWarning reason,
	ElementId^ part1,
	ElementId^ part2
)
```

# ### Parameters
resolution
    Type: Autodesk.Revit.DB..::..ConnectionResolution Resolution type.
reason
    Type: Autodesk.Revit.DB..::..ConnectionWarning Warning reason.
part1
    Type: Autodesk.Revit.DB..::..ElementId First element Id.
part2
    Type: Autodesk.Revit.DB..::..ElementId Second element Id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace